blog/2010/05/24/solar-system-1_0_1-win-0_3-release/index.html
<!DOCTYPE html>
<html lang="en-us">
<head>
  <title>solar-system- 1.01-win-0.3发布 - Gu Weigang</title>
  <meta charset="utf-8" />
  <meta name="author" content="Gu Weigang" />
  <meta name="description" content="" />
  <meta name="keywords" content="" />

  <link rel="alternate" title="RSS Feed" href="/rss.xml" type="application/rss+xml">

  <link rel="stylesheet" href="/media/css/main.css" type="text/css">
  <link rel="stylesheet" href="/media/css/prettify.css" type="text/css">
</head>

  <body class="container">
<header id="header">
  <h1 class="title"><a href="/">Gu Weigang</a></h1>
  <ul>
    <li><a href="/blog/">Blog</a></li>
    <li><a href="/tags/">Tags</a></li>
    <li><a href="/about/">About</a></li>
  </ul>
  <form method="get" id="search" action="https://duckduckgo.com">
    <input type="text" class="field" name="q" id="s" placeholder="Search">
    <input type="hidden" name="q" value="site:guweigang.com">
  </form>
</header>

<section id="content" role="main">
  <h1>solar-system- 1.01-win-0.3发布</h1>
  <p>
为了能让更多人使用solar php，我一直在不停地做solar windows版本的工作，今天终于能够给大家带来一个好消息了，这个版本是solar-win的一个里程卑版本，在这个版本中，solar-win的行为已经和linux下面几乎一致了。
</p>

<p>
用法请参考/README和/script/README。
</p>


<blockquote>
<p>
Solar-Win
<code>=======</code>
<del>++</del> 请确保您的系统版本是vista（含）以上 <del>++</del>
</p>

<p>
[更新列表]
</p>

<p>
修改的文件：
</p>
<ol class="org-ol">
<li>script/solar
</li>
<li>source/solar/Solar/Dir.php
</li>
<li>source/solar/Solar/Symlink.php
</li>
<li>source/solar/Solar/Cli/LinkVendor.php
</li>
<li>source/solar/Solar/Cli/UnlinkVendor.php
</li>
</ol>

<p>
添加的文件：
</p>
<ol class="org-ol">
<li>script/solar.bat
</li>
<li>script/phpenv.ini
</li>
<li>script/readme
</li>
</ol>

<p>
教程(虽然在windows下，请仍然注意大小写)
<code>===============================</code>
由于当前windows系统下不允许symlink复制，所以在windows下必须先初始化solar环境。
</p>

<ol class="org-ol">
<li>配置script/phpenv.ini，如何配置请参考script/README
</li>

<li>以管理员身份打开CMD，换到solarwin目录下：
</li>
</ol>
<p>
C:\Users\ROY&gt;d:
D:\&gt;cd wamp\www\solarwin\
D:\wamp\www\solarwin&gt;script\solar link-vendor Solar
</p>

<ol class="org-ol">
<li>OK, 这一步完成后，请检查你的include/目录，
</li>
</ol>


<pre class="example">
      2010-05-24  12:12     .
2010-05-24  12:12     ..
2010-05-24  12:12     Fixture
2010-05-24  12:12     Mock
2010-05-23  12:25     Solar [..\source\solar\Solar]
2010-05-23  12:26     Solar.php [..\source\solar\Solar.php]
2010-05-24  12:12     Test
</pre>


<p>
如果你include目录像上面这样，那说明环境初使化成功。
</p>

<ol class="org-ol">
<li>像在linux中一样使solar，具体参考script/README
</li>
</ol>
</blockquote>


<p>
下载地址：<a href="http://solarphp.cn/download/solar-system-1.01-win-0.3.rar"><a href="http://solarphp.cn/download/solar-system-1.01-win-0.3.rar">http://solarphp.cn/download/solar-system-1.01-win-0.3.rar</a></a>
</p>

<p>
当然，你总是可以从这里下载最新的版本：<a href="http://solarphp.cn/download/solar-system-1.01-win-latest.rar"><a href="http://solarphp.cn/download/solar-system-1.01-win-latest.rar">http://solarphp.cn/download/solar-system-1.01-win-latest.rar</a></a>
</p>

</section>



<footer id="footer">
    Send comments, critique and suggestions to <a href="mailto:guweigang &lt;at&gt; outlook &lt;dot&gt; com">Gu Weigang</a>.
    Powered by <a href="https://github.com/kelvinh/org-page">org-page</a>
</footer>

  </body>
</html>
